announcements/debug-tts-servers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HowTo: Log TTS Server Output To Aid In TTS Server Development</title>
<!-- 2015-04-15 Wed 17:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="raman" />
</head>
<body>
<div id="content">
<h1 class="title">HowTo: Log TTS Server Output To Aid In TTS Server Development</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> HowTo: Log TTS Server Output To Aid In TTS Server Development</h2>
<div class="outline-text-2" id="text-1">
<p>
This is mostly of interest to developers of Emacspeak speech servers.
This article outlines how one can log TTS server output to a file.
The loggeds record all commands send by Emacspeak to the TTS server.
It is best to generate the logs in an Emacs session that is separate
from the Emacs session where you are developping your code.
This keeps the logs short, and makes isolating problems much easier.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> How It Works</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The <span class="underline">emacspeak/servers</span> directory now contains <span class="underline">log_&lt;tts-name&gt;</span>
servers for the various supported speech servers.  When selected,
these <i>log-speech</i> servers produce no speech output; instead, they
output the speech server commands received from Emacspeak to a file in
<span class="underline">/tmp</span> named <span class="underline">tts-log-$$</span>.
Once you're done logging, you can examine this file  from the primary Emacs session.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Typical Workflow</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Assume you want to see the speech-server commands sent by Emacs when you perform a specific action, in this instance, pressing <span class="underline">C-e m</span> to execute command <span class="underline">emacspeak-speak-mode-line</span>.
</p>

<ol class="org-ol">
<li>In  a separate Linux  console or X-Window, launch Emacs with Emacspeak loaded &#x2014; this is  separate from your primary Emacs session.
</li>
<li>In this Emacs session, use <span class="underline">C-e d d</span> (command <span class="underline">dtk-select-server</span>) and select <span class="underline">log-&lt;tts-name&gt;</span> as the speech server, where <span class="underline">tts-name</span> corresponds to the speech engine you're testing.
</li>
<li>Emacspeak will now start the logging server, and fall silent; all  commands sent by Emacspeak to the speech-server will be logged to a file in <span class="underline">/tmp</span>.
</li>
<li>Press <span class="underline">C-e m</span> &#x2013; to produce the log output you want to see.
</li>
<li>Use command _emacspeak-emergency-tts-restart  to get speech back.
</li>
<li>Open a <span class="underline">dired</span> buffer on <span class="underline">/tmp</span>, press <span class="underline">s</span> to sort files by date, and find your generated log output at the top of the list.
</li>
<li>Note: It is useful to configure your default speech engine via  Custom &#x2013; see user option  <span class="underline">emacspeak-emergency-tts-server</span>.   It provides a quick-fire means to get speech back if you ever switch to a speech-server that fails for some reason.
</li>
</ol>
<p>
<b>Share And Enjoy</b>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-04-15 Wed&gt;</span></span></p>
<p class="author">Author: raman</p>
<p class="date">Created: 2015-04-15 Wed 17:33</p>
<p class="creator">Emacs 25.0.50.1 (Org mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
